erp3l/src/Catalogs/БланкиОтчетов/БланкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоУмолчанию</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчаниюВВидеБланка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеВМакете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкДляОтображения</name>
    <comment>Данный бланк используется только для отображения, так как не содержит всех ключевых реквизитов аналитик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаШапки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодвала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСтруктуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСводнойТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ракурс</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимБланка</name>
    <comment>0 - Однопериодный бланк, 1- Сводная таблица, 2 - Многопериодный бланк</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультиязычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетРаскрытий</name>
    <comment>Содержит ТЧ частей макета для каждой группы раскрытия</comment>
    <attributes>
      <name>КодГруппыРаскрытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Макет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаЭлементовСтруктурыОтчета</name>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.СтрокиОтчетов</types>
        <types>CatalogRef.КолонкиОтчетов</types>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресС1К1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеБланки</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ПоказателиОтчетов/ПоказателиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОтчетов</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутриГрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.КолонкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборотный</name>
    <comment>При консолидации учитывется индекс присутствия в периоде</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <comment>Точность отображения показателя не зависит от точности отображения документа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка</name>
    <type>
      <types>CatalogRef.СтрокиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаПоСчету</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКритичности</name>
    <type>
      <types>EnumRef.УровниКритичностиКонтрольныхСоотношений</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОтраженияКурсовыхРазниц</name>
    <comment>//Удалить</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентТР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КонтролироватьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаИтогаПоПериоду</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателяПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСуммируется</name>
    <comment>Не суммируется при консолидации / свертке значений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементБюджета</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
      <types>CatalogRef.ПоказателиБюджетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиДляКурсовВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКурса</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/БланкиОтчетов/Forms/ГенерацияПоказателей/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.
//

&НаСервере
Процедура ВывестиСтрокиВРекурсии(Строки, ТаблицаСтрок, ЭлементыСтроки)
	
	ТекущиеЭлементы = ЭлементыСтроки.ПолучитьЭлементы();
	Для Каждого Строка Из Строки Цикл
		
		ТекЭлементСтроки = ТекущиеЭлементы.Добавить();
		ТекЭлементСтроки.Строка = Строка.Ссылка;
		
		Для Каждого КлючИЗначение Из СтруктураКодовИСсылокНаКолонки Цикл
			
			НайденныеСтроки = ТаблицаСтрок.НайтиСтроки(Новый Структура("Ссылка, КодКолонки", Строка.Ссылка, ОбщегоНазначенияУХ.ДополнитьДоЗаданнойДлины(КлючИЗначение.Ключ, ДлинаКодаКолонки)));
			
			ТекЭлементСтроки[КлючИЗначение.Ключ] = Истина;
			ТекЭлементСтроки[КлючИЗначение.Ключ + "_Использование"] = ?(НайденныеСтроки.Количество() = 0, 1, 0);
			
		КонецЦикла;
		
		ВывестиСтрокиВРекурсии(Строка.Строки, ТаблицаСтрок, ТекЭлементСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиВКарту()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КолонкиОтчетов.Ссылка КАК Ссылка,
	|	КолонкиОтчетов.Представление КАК Представление,
	|	КолонкиОтчетов.Код КАК Код
	|ИЗ
	|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|ГДЕ
	|	КолонкиОтчетов.Владелец = &Владелец";
	Если МассивКодовКолонок.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|И КолонкиОтчетов.Код В(&МассивКодов)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиОтчетов.ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	
	Если МассивКодовКолонок.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("МассивКодов", МассивКодовКолонок);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивРеквизитов    = Новый Массив;
	ОписаниеТиповБулево = ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево();
	ОписаниеТиповЧисло  = ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(1, 0);
	МассивЭлементов     = Новый Массив;
	
	Структура        = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		КодОтчета = СокрЛП(Выборка.Код);
		
		Структура.Вставить(КодОтчета, Выборка.Ссылка);
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(КодОтчета, ОписаниеТиповБулево, "Карта", Выборка.Представление, Ложь));
		МассивРеквизитов.Добавить(Новый РеквизитФормы(КодОтчета + "_Использование", ОписаниеТиповЧисло, "Карта", Выборка.Представление, Ложь));
		Элемент = Элементы.Добавить(КодОтчета, Тип("ПолеФормы"), Элементы.Карта);
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ЦветФонаЗаголовка = WebЦвета.СветлоЖелтыйЗолотистый;
		
		МассивЭлементов.Добавить(Элемент);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		
		Элемент.ПутьКДанным = "Карта." + Элемент.Имя;
		
		ЭлементОформления   = УсловноеОформление.Элементы.Добавить();
		
		НовыйЭлементОтбора  = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Карта." + Элемент.Имя + "_Использование");
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = 0;
		НовыйЭлементОтбора.Использование  = Истина;
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		НовоеПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		НовоеПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элемент.Имя);
		НовоеПолеОформления.Использование = истина;
		
		ЭлементОформления.Использование = Истина;
		
		ЭлементОформления   = УсловноеОформление.Элементы.Добавить();
		НовыйЭлементОтбора  = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Карта." + Элемент.Имя + "_Использование");
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = 1;
		НовыйЭлементОтбора.Использование  = Истина;
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.АкварельноСиний);
		НовоеПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		НовоеПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элемент.Имя);
		НовоеПолеОформления.Использование = истина;
		
		ЭлементОформления.Использование = Истина;
		
		ЭлементОформления   = УсловноеОформление.Элементы.Добавить();
		НовыйЭлементОтбора  = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Карта." + Элемент.Имя + "_Использование");
		НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = 2;
		НовыйЭлементОтбора.Использование  = Истина;
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);
		НовоеПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		НовоеПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элемент.Имя);
		НовоеПолеОформления.Использование = истина;
		
		ЭлементОформления.Использование = Истина;
		
	КонецЦикла;
	
	СтруктураКодовИСсылокНаКолонки = Новый ФиксированнаяСтруктура(Структура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтрокиОтчетов.Ссылка КАК Ссылка,
	|	КолонкиОтчетов.Код КАК КодКолонки,
	|	СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер
	|ПОМЕСТИТЬ ВременноеХранилище
	|ИЗ
	|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|			ПО ПоказателиОтчетов.Колонка = КолонкиОтчетов.Ссылка
	|		ПО (ПоказателиОтчетов.Строка = СтрокиОтчетов.Ссылка)
	|ГДЕ
	|	СтрокиОтчетов.Владелец = &Владелец";
	Если МассивКодовСтрок.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И СтрокиОтчетов.Код В(&МассивКодов)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременноеХранилище.Ссылка,
	|	ВременноеХранилище.КодКолонки
	|ИЗ
	|	ВременноеХранилище КАК ВременноеХранилище
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременноеХранилище.Ссылка,
	|	ВременноеХранилище.ПорядковыйНомер
	|ИЗ
	|	ВременноеХранилище КАК ВременноеХранилище
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременноеХранилище.Ссылка ИЕРАРХИЯ,
	|	ВременноеХранилище.ПорядковыйНомер";
	
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	
	Если МассивКодовСтрок.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("МассивКодов", МассивКодовСтрок);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаСтрок = РезультатЗапроса[1].Выгрузить();
	ДеревоСтрок = РезультатЗапроса[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ВывестиСтрокиВРекурсии(ДеревоСтрок.Строки, ТаблицаСтрок, Карта);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКодовСтрок   = Новый ФиксированныйМассив(Параметры.МассивКодовСтрок);
	МассивКодовКолонок = Новый ФиксированныйМассив(Параметры.МассивКодовКолонок);
	
	Параметры.Свойство("ВидОтчета", ВидОтчета);
	
	ДлинаКодаСтроки  = Метаданные.Справочники.СтрокиОтчетов.ДлинаКода;
	ДлинаКодаКолонки = Метаданные.Справочники.КолонкиОтчетов.ДлинаКода;
	
	ДобавитьКолонкиВКарту();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.
//


&НаКлиенте
Процедура НаследоватьНастройкиОтКолонки(Команда)
	
	УстановитьДляПоказателя(2);
	
КонецПроцедуры

&НаКлиенте
Процедура НаследоватьНастройкиОтСтрок(Команда)
	
	УстановитьДляПоказателя(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Закрыть(СформироватьПоказатели());
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ПоказателиОтчетов"));
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьФлажкиДляКолонки(Команда)
	
	УстановитьДляКолонки(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажкиДляКолонки(Команда)
	
	УстановитьДляКолонки(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажкиДляСтроки(Команда)
	
	УстановитьДляСтроки(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьФлажкиДляСтроки(Команда)
	
	УстановитьДляСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НаследоватьНастройкиОтКолонкиДляКолонки(Команда)
	
	УстановитьДляКолонки(2);
	
КонецПроцедуры

&НаКлиенте
Процедура НаследоватьНастройкиОтКолонкиДляСтроки(Команда)
	
	УстановитьДляСтроки(2);
	
КонецПроцедуры

&НаКлиенте
Процедура НаследоватьНастройкиОтСтрокДляКолонки(Команда)
	
	УстановитьДляКолонки(1);
	
КонецПроцедуры

&НаКлиенте
Процедура НаследоватьНастройкиОтСтрокДляСтроки(Команда)
	
	УстановитьДляСтроки(1);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УСТАНОВКИ-СБРОСА ЗНАЧЕНИЙ
//

&НаКлиенте
Процедура УстановитьДляСтроки(Значение)
	
	ТД = Элементы.Карта.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Использование = ТипЗнч(Значение) = Тип("Число");
	
	Для Каждого ПодчиненныйЭлемент Из Элементы.Карта.ПодчиненныеЭлементы Цикл
		
		Если 
			ПодчиненныйЭлемент.Имя = "КартаСтрока" 
			ИЛИ СтрЧислоВхождений(ПодчиненныйЭлемент, "_Использование") > 0
			ИЛИ ТД[ПодчиненныйЭлемент.Имя + "_Использование"] = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТД[ПодчиненныйЭлемент.Имя + ?(Использование, "_Использование", "")] = Значение;
		
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляКолонки(Значение)
	
	ИмяТекущегоЭлемента = Элементы.Карта.ТекущийЭлемент.Имя;
	
	Если ИмяТекущегоЭлемента = "КартаСтрока" Тогда
		Возврат;
	КонецЕсли;
	
	Использование = ТипЗнч(Значение) = Тип("Число");
	
	Для Каждого Строка Из Карта.ПолучитьЭлементы() Цикл
		Если Строка[ИмяТекущегоЭлемента + "_Использование"] <> 0 Тогда
			Строка[ИмяТекущегоЭлемента + ?(Использование, "_Использование", "")] = Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляПоказателя(Значение)
	
	ИмяТекущегоЭлемента = Элементы.Карта.ТекущийЭлемент.Имя;
	Если ИмяТекущегоЭлемента = "КартаСтрока" Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Карта.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные[ИмяТекущегоЭлемента + "_Использование"] = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные[ИмяТекущегоЭлемента + "_Использование"] = Значение;
	
КонецПроцедуры



&НаСервере
Функция СформироватьПоказатели()
	
	Показатели = Новый Массив;
	
	ФормироватьПоказателиРекурсивно(Карта, Показатели);
	
	Возврат Показатели;
	
КонецФункции

&НаСервере
Процедура ФормироватьПоказателиРекурсивно(Строки, Показатели)
	
	ВнЭлементы = Строки.ПолучитьЭлементы();
	
	ТаблицаИзмененныхПоказателей=Новый ТаблицаЗначений;
	ТаблицаИзмененныхПоказателей.Колонки.Добавить("Ссылка");
	ТаблицаИзмененныхПоказателей.Колонки.Добавить("ОбъектДобавлен",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ТаблицаИзмененныхПоказателей.Колонки.Добавить("ПометкаУдаления",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	
	Для Каждого Элемент Из ВнЭлементы Цикл
		
		Строка = Элемент.Строка;
		
		Для Каждого КлючИЗначение Из СтруктураКодовИСсылокНаКолонки Цикл
			
			Если Элемент[КлючИЗначение.Ключ] Тогда
				
				Использование = Элемент[КлючИЗначение.Ключ + "_Использование"];
				
				Если Использование <> 0 Тогда
					
					ОписаниеНовогоПоказателя = Новый Структура;
					
					Справочники.ВидыОтчетов.СформироватьПоказатель(ВидОтчета,Строка,КлючИЗначение.Значение,Использование, ОписаниеНовогоПоказателя,,,СтруктураКодовИСсылокНаКолонки.Количество()=1,ТаблицаИзмененныхПоказателей);
					
					Если ОписаниеНовогоПоказателя.Количество() Тогда
						Показатели.Добавить(ОписаниеНовогоПоказателя);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ФормироватьПоказателиРекурсивно(Элемент, Показатели);
		
	КонецЦикла;
		
КонецПроцедуры
